Revit 2027 API
CADLinkOptions(CADLinkOptions) Constructor
 Constructs a new copy of the input CADLinkOptions object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CADLinkOptions(
	CADLinkOptions other
)
Public Sub New (
	other As CADLinkOptions
)
public:
CADLinkOptions(
	CADLinkOptions^ other
)
new :
        other : CADLinkOptions -> CADLinkOptions
Parameters
other CADLinkOptions
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CADLinkOptions Class
CADLinkOptions Overload
Autodesk.Revit.DB Namespace